#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.ВыпускПродукции.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.4.9.15";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9bfc3b84-d594-4ef4-8d43-95494bf4bb1f");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.ВыпускПродукции.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Перезаполняет ресурс ""Количество"" в записях с переполнением значения из-за несоответствия разрядности ресурса и реквизитов документов-регистраторов.'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.ВыпускПродукции.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ОтчетПереработчика.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПоступлениеОтПереработчика.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПроизводствоБезЗаказа.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.ВыпускПродукции.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ПроизводствоБезЗаказа.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ТоварыОрганизаций.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "Любой";

КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.ВыпускПродукции";
	ИмяРегистра = "ВыпускПродукции";
	
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить("Документ.ОтчетПереработчика");
	СписокДокументов.Добавить("Документ.ПроизводствоБезЗаказа");
	
	Для каждого ПолноеИмяДокумента Из СписокДокументов Цикл
		
		ИмяДокумента = СтрРазделить(ПолноеИмяДокумента, ".")[1];
		
		ТекстЗапросаМеханизмаПроведения = Документы[ИмяДокумента].АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра);
		Регистраторы = ОбновлениеИнформационнойБазыУТ.РегистраторыДляПерепроведения(
			ТекстЗапросаМеханизмаПроведения,
			ПолноеИмяРегистра,
			ПолноеИмяДокумента);
								
		ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
		
	КонецЦикла;
	
	//
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Регистр.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ВыпускПродукции КАК Регистр
		|ГДЕ
		|	Регистр.Регистратор ССЫЛКА Документ.ВыпускПродукции
		|	И Регистр.КодСтроки <> 0
		|	И ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Документ.ВыпускПродукции.Товары КАК Товары
		|			ГДЕ
		|				Товары.Ссылка = Регистр.Регистратор
		|				И Товары.КодСтроки = Регистр.КодСтроки
		|				И Товары.АналитикаУчетаНоменклатуры = Регистр.АналитикаУчетаНоменклатуры
		|				И Товары.Количество <> Регистр.Количество)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Регистр.Регистратор
		|ИЗ
		|	РегистрНакопления.ВыпускПродукции КАК Регистр
		|ГДЕ
		|	Регистр.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
		|	И Регистр.КодСтроки <> 0
		|	И ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Документ.ПоступлениеОтПереработчика.Товары КАК Товары
		|			ГДЕ
		|				Товары.Ссылка = Регистр.Регистратор
		|				И Товары.КодСтроки = Регистр.КодСтроки
		|				И Товары.АналитикаУчетаНоменклатуры = Регистр.АналитикаУчетаНоменклатуры
		|				И Товары.Количество <> Регистр.Количество)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Регистр.Регистратор
		|ИЗ
		|	РегистрНакопления.ВыпускПродукции КАК Регистр
		|ГДЕ
		|	Регистр.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
		|	И Регистр.КодСтроки <> 0
		|	И ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Документ.ПоступлениеОтПереработчика.ВозвратныеОтходы КАК Товары
		|			ГДЕ
		|				Товары.Ссылка = Регистр.Регистратор
		|				И Товары.КодСтроки = Регистр.КодСтроки
		|				И Товары.АналитикаУчетаНоменклатуры = Регистр.АналитикаУчетаНоменклатуры
		|				И Товары.Количество <> Регистр.Количество)");
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить("Документ.ВыпускПродукции");
	СписокДокументов.Добавить("Документ.ОтчетПереработчика");
	СписокДокументов.Добавить("Документ.ПоступлениеОтПереработчика");
	СписокДокументов.Добавить("Документ.ПроизводствоБезЗаказа");
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(
		СписокДокументов,
		"РегистрНакопления.ВыпускПродукции",
	    Параметры.Очередь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
