
&НаСервере
Процедура bt_Patch2ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Долг = 0;
	
	bt_Patch2ПартнерПриИзмененииПослеНаСервере(Объект.Партнер, Объект.Организация, Долг);
	
	Если Долг > 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Нам должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Красный;
		
	ИначеЕсли Долг < 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Мы должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Зеленый;
		
	ИНаче
		
		Элементы.Декорация5.Заголовок = "Нет задолженностей";
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Синий;
		
	КонецЕсли;
	
	Объект.ЦенаВключаетНДС = Истина;
	Объект.РегистрироватьЦеныПоставщика = Истина;
	
	
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2ПартнерПриИзмененииПосле(Элемент)
	
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2ОрганизацияПриИзмененииПосле(Элемент)
	
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2Декорация5НажатиеПосле(Элемент)
	
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура bt_Patch2ПартнерПриИзмененииПослеНаСервере(Партнер, Организация, Долг)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ ВТКлючиАналитики
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	АналитикаУчетаПоПартнерам.Партнер = &Партнер
	|	И АналитикаУчетаПоПартнерам.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|			,
	|			АналитикаУчетаПоПартнерам В
	|				(ВЫБРАТЬ
	|					ВТКлючиАналитики.КлючАналитики КАК КлючАналитики
	|				ИЗ
	|					ВТКлючиАналитики КАК ВТКлючиАналитики)) КАК РасчетыСПоставщикамиОстатки";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Долг = ВыборкаДетальныеЗаписи.СуммаОстаток;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура bt_Patch2РассчитатьИОборазитьДолгКлиента()
	
	Долг = 0;

	bt_Patch2ПартнерПриИзмененииПослеНаСервере(Объект.Партнер, Объект.Организация, Долг);
	
	Если Долг > 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Нам должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Красный;
		
	ИначеЕсли Долг < 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Мы должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Зеленый;
		
	ИНаче
		
		Элементы.Декорация5.Заголовок = "Нет задолженностей";
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Синий;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

