////////////////////////////////////////////////////////////////////////////////
// Ведомости на выплату зарплаты.
// Клиент-серверные процедуры и функции.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ВидДоходаОбязателенДляБанков(Дата) Экспорт
	Возврат НачалоДня(Дата) >= ДатаНачалаПередачиВидаДоходаБанку();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДатаНачалаПередачиВидаДоходаБанку()
	Возврат '20200601';
КонецФункции

#КонецОбласти
