
&НаСервере
Процедура bt_Patch2_ПриСменеСтраницыНаСервере()
	
	Перем ПолеКонтрагент;
	Перем ПолеОрганизация;
	Перем ПолеДоговор;
	
	Для каждого ТекЭлемент Из Элементы Цикл
	
		Если ТипЗнч(ТекЭлемент) = Тип("ПолеФормы") и Лев(ТекЭлемент.ПутьКДанным,30) = "ДополнительныйРеквизитЗначение"  Тогда
			
			Если ТипЗнч(ЭтотОбъект[ТекЭлемент.ПутьКДанным]) = Тип("справочникСсылка.ДоговорыКонтрагентов") Тогда
				
				ПолеДоговор = ТекЭлемент;
				
			ИначеЕсли ТипЗнч(ЭтотОбъект[ТекЭлемент.ПутьКДанным]) = Тип("справочникСсылка.Контрагенты")  Тогда
				
				bt_Patch5_Контрагент = ЭтотОбъект[ТекЭлемент.ПутьКДанным];
				ПолеКонтрагент = ТекЭлемент;
				
			ИначеЕсли ТипЗнч(ЭтотОбъект[ТекЭлемент.ПутьКДанным]) = Тип("справочникСсылка.Организации")  Тогда
				
				bt_Patch5_Организация = ЭтотОбъект[ТекЭлемент.ПутьКДанным];
				ПолеОрганизация = ТекЭлемент;
				
			ИначеЕсли ТипЗнч(ЭтотОбъект[ТекЭлемент.ПутьКДанным]) = Тип("Строка")  Тогда
				
				ТекЭлемент.КнопкаВыпадающегоСписка = Истина;
				ТекЭлемент.БыстрыйВыбор = Истина;
				bt_Patch2_СформироватьСписокВыбораАдресовДоставки(ТекЭлемент.СписокВыбора);
				
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Если ПолеДоговор <> Неопределено Тогда
	
		bt_Patch2_КонтрагентОрганизацияПриИзмененииНаСервере(ПолеДоговор);
		ПолеКонтрагент.УстановитьДействие("ПриИзменении","bt_Patch2_КонтрагентОрганизацияПриИзменении");
		ПолеОрганизация.УстановитьДействие("ПриИзменении","bt_Patch2_КонтрагентОрганизацияПриИзменении");
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура bt_Patch2_КонтрагентОрганизацияПриИзмененииНаСервере(ПолеДоговор)
	
	Массив = Новый Массив;
	
	Если ПолеДоговор.ПараметрыВыбора.Количество() > 0 Тогда
	
		ПолеДоговор.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
	КонецЕсли;
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Контрагент", bt_Patch5_Контрагент);
	Массив.Добавить(ПараметрВыбора);
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Организация", bt_Patch5_Организация);
	Массив.Добавить(ПараметрВыбора);
	
	ПолеДоговор.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);

КонецПроцедуры // КонтрагентНачалоВыбора()

&НаСервере
Процедура bt_Patch2_КонтрагентОрганизацияПриИзмененииДанныхНаСервере()

	Для каждого ТекЭлемент Из Элементы Цикл
	
		Если ТипЗнч(ТекЭлемент) = Тип("ПолеФормы") и Лев(ТекЭлемент.ПутьКДанным,30) = "ДополнительныйРеквизитЗначение"  Тогда
			
			Если ТипЗнч(ЭтотОбъект[ТекЭлемент.ПутьКДанным]) = Тип("справочникСсылка.Контрагенты")  Тогда
				
				bt_Patch5_Контрагент = ЭтотОбъект[ТекЭлемент.ПутьКДанным];
				
			ИначеЕсли ТипЗнч(ЭтотОбъект[ТекЭлемент.ПутьКДанным]) = Тип("справочникСсылка.Организации")  Тогда
				
				bt_Patch5_Организация = ЭтотОбъект[ТекЭлемент.ПутьКДанным];
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	
	Для каждого ТекЭлемент Из Элементы Цикл
	
		Если ТипЗнч(ТекЭлемент) = Тип("ПолеФормы") и Лев(ТекЭлемент.ПутьКДанным,30) = "ДополнительныйРеквизитЗначение"  Тогда
			
			Если ТипЗнч(ЭтотОбъект[ТекЭлемент.ПутьКДанным]) = Тип("справочникСсылка.ДоговорыКонтрагентов") Тогда
				
				ЭтотОбъект[ТекЭлемент.ПутьКДанным] = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
				bt_Patch2_КонтрагентОрганизацияПриИзмененииНаСервере(ТекЭлемент);
				
			ИначеЕсли ТипЗнч(ЭтотОбъект[ТекЭлемент.ПутьКДанным]) = Тип("Строка")  Тогда
				
				ТекЭлемент.СписокВыбора.Очистить();
				ЭтотОбъект[ТекЭлемент.ПутьКДанным] = "";
				ТекЭлемент.ОбновлениеТекстаРедактирования = ОбновлениеТекстаРедактирования.Всегда;
				bt_Patch2_СформироватьСписокВыбораАдресовДоставки(ТекЭлемент.СписокВыбора);
			
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // КонтрагентНачалоВыбора()

&НаКлиенте
Процедура bt_Patch2_КонтрагентОрганизацияПриИзменении(Элемент) Экспорт 
	
	bt_Patch2_КонтрагентОрганизацияПриИзмененииДанныхНаСервере();

КонецПроцедуры // КонтрагентНачалоВыбора()

&НаКлиенте
Процедура bt_Patch2_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаДополнительно" Тогда
	
		bt_Patch2_ПриСменеСтраницыНаСервере();
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция bt_Patch2_СформироватьСписокВыбораАдресовДоставки(СЗ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Партнер = ПартнерыКонтактнаяИнформация.Ссылка)
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка
	|	И ПартнерыКонтактнаяИнформация.Вид = Значение(Справочник.ВидыКонтактнойИнформации.АдресПартнера)";
	
	Запрос.УстановитьПараметр("Ссылка", bt_Patch5_Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Массив = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Представление");
	
	СЗ.ЗагрузитьЗначения(Массив);
	
	Возврат Истина; 

КонецФункции // СформироватьСписокВыбораАдресовДоставки()

&НаСервере
Процедура bt_Patch2_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
	
		Объект.Дата = ТекущаяДата() + 86400;
		
	
	КонецЕсли;
	
КонецПроцедуры

