
&После("ОбработкаПроверкиЗаполнения")
Процедура bt_Patch2ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ЭтотОбъект["ЗаданиеНаПеревозку"]) = Ложь Тогда
		
		Для каждого ТекДок Из ЭтотОбъект["ДокументыОснования"] Цикл
			
			Реализация = ТекДок.ДокументОснование;
			
			Если ТипЗнч(Реализация) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И 
				Реализация.СпособДоставки <> Перечисления.СпособыДоставки.Самовывоз Тогда
				
				Отказ = Ложь;
				
			КонецЕсли;                
			
		КонецЦикла;                         
		
	КонецЕсли;
	
	Сообщить("!!!!----------!!");
	Сообщить("Можно печатать!!");

КонецПроцедуры
