#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	//++ НЕ УТ
	ПредставлениеПравила = Справочники.ПравилаРаспределенияРасходов.ПолучитьПредставлениеПравила(
		ОтборПоМатериалам, ОтборПоВидамРабот, ОтборПоПродукции, БазаРаспределенияПоПартиям);
	//-- НЕ УТ
	
КонецПроцедуры

//++ НЕ УТ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("НазначениеПравила")
		И ДанныеЗаполнения.НазначениеПравила = Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоПодразделениям
		И Не ДанныеЗаполнения.Свойство("БазаРаспределения") Тогда
		ДанныеЗаполнения.Вставить("БазаРаспределения", Перечисления.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно);
	КонецЕсли;
	
КонецПроцедуры
//-- НЕ УТ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	Если Устаревшее Тогда
		
		НепроверяемыеРеквизиты.Добавить("БазаРаспределенияПоПартиям");
		НепроверяемыеРеквизиты.Добавить("СтатьяСписанияРБП");
		НепроверяемыеРеквизиты.Добавить("АналитикаРасходовРБП");
		//++ НЕ УТ
		НепроверяемыеРеквизиты.Добавить("БазаРаспределенияПоПодразделениям");
		НепроверяемыеРеквизиты.Добавить("ДоляСтоимостиНаПроизводство");
		НепроверяемыеРеквизиты.Добавить("Показатель");
		//-- НЕ УТ
		
	Иначе
		
		//++ НЕ УТ
		НепроверяемыеРеквизиты.Добавить("БазаРаспределения");
		
		Если Не (РаспределятьПоПартиям И РаспределятьНаСтатьи
			И Не (УточнятьПартииВДокументе Или ПодразделенияУказаныВручную)) Тогда
			НепроверяемыеРеквизиты.Добавить("ДоляСтоимостиНаПроизводство");
		КонецЕсли;
		
		Если Не РаспределятьПоПодразделениям Или ПодразделенияУказаныВручную Тогда
			НепроверяемыеРеквизиты.Добавить("БазаРаспределенияПоПодразделениям");
		КонецЕсли;
		
		Если Не РаспределятьПоПартиям 
				Или УточнятьПартииВДокументе Тогда
			НепроверяемыеРеквизиты.Добавить("БазаРаспределенияПоПартиям");
		КонецЕсли;
		
		Если Не (БазаРаспределенияПоПодразделениям = Перечисления.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно
			Или БазаРаспределенияПоПодразделениям = Перечисления.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении) Тогда
			НепроверяемыеРеквизиты.Добавить("Показатель");
		КонецЕсли;
		
		РеквизитыПроверкиАналитик = Новый Массив;
		РеквизитыПроверкиАналитик.Добавить("СтатьяСписанияРБП, АналитикаРасходовРБП");
		РеквизитыПроверкиАналитик.Добавить(Новый Структура("Списание"));
		ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
			ЭтотОбъект, РеквизитыПроверкиАналитик, НепроверяемыеРеквизиты, Отказ);
			
		//-- НЕ УТ
				
		Если Не НазначениеПравила = Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаРБП Тогда
			
			НепроверяемыеРеквизиты.Добавить("СтатьяСписанияРБП");
			НепроверяемыеРеквизиты.Добавить("АналитикаРасходовРБП");
			
		Иначе
			НепроверяемыеРеквизиты.Добавить("БазаРаспределенияПоПартиям");
		КонецЕсли;
		
		Если НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.ПоКоэффициентам Тогда
			НепроверяемыеРеквизиты.Добавить("БазаРаспределенияПоПартиям");
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
