
&НаСервере
Процедура bt_Patch4_ЗаполнитьМОМВместоНаСервере1()
	
	ДЗ_УсловияРегионализации = РеквизитФормыВЗначение("УсловияРегионализации");
	
	Количество_У1 = ДЗ_УсловияРегионализации.Строки.Количество();
	
	Для Инд_У1 = 0 По (Количество_У1 - 1) Цикл
		
		Строка_У1 = ДЗ_УсловияРегионализации.Строки[Инд_У1];
		Строка_У1.Выполняются = 1;
		
		Если Инд_У1 = 0 Тогда
			//молочная продукция, Болезнь Ауески (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1
					
				КонецЦикла;
			КонецЕсли;
			
			Если Строка_У1.Строки.Количество() > 1 Тогда
				
				Строка_У2 = Строка_У1.Строки[1];
				Строка_У2.Выполняются = 0;
				
				Если Строка_У2.Строки.Количество() > 1 Тогда
					Строка_У3 = Строка_У2.Строки[1];
					Строка_У3.Выполняются = 1;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Инд_У1 = 1 Тогда
			//молочная продукция, Бруцеллез крупного рогатого скота (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
			КонецЕсли;
			
			Если Строка_У1.Строки.Количество() > 1 Тогда
				
				Строка_У2 = Строка_У1.Строки[1];
				Строка_У2.Выполняются = 0;
				
				Если Строка_У2.Строки.Количество() > 1 Тогда
					Строка_У3 = Строка_У2.Строки[1];
					Строка_У3.Выполняются = 1;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Инд_У1 = 2 Тогда
			//молочная продукция, Генитальный кампилобактериоз крупного рогатого скота (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
				
				Если Строка_У1.Строки.Количество() > 1 Тогда
					
					Строка_У2 = Строка_У1.Строки[1];
					Строка_У2.Выполняются = 0;
					
					Если Строка_У2.Строки.Количество() > 1 Тогда
						Строка_У3 = Строка_У2.Строки[1];
						Строка_У3.Выполняются = 1;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
			
		ИначеЕсли Инд_У1 = 3 Тогда
			
			//молочная продукция, Заразный узелковый дерматит (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли Инд_У1 = 4 Тогда
			//молочная продукция, Инфекционный ринотрахеит КРС/инфекционный пустулёзный вульвовагинит (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли Инд_У1 = 5 Тогда
			//молочная продукция, Лейкоз крупного рогатого скота (пункт 1)
			
			Для каждого Строка_У2 Из Строка_У1.Строки  Цикл
				
				Строка_У2.Выполняются = 1;
				
			КонецЦикла;
			
		ИначеЕсли Инд_У1 = 6 Тогда
			//молочная продукция, Лептоспироз КРС (пункт 1)
			
			Для каждого Строка_У2 Из Строка_У1.Строки  Цикл
				
				Строка_У2.Выполняются = 1;
				
			КонецЦикла;
			
		ИначеЕсли Инд_У1 = 7 Тогда
			//молочная продукция, Листериоз (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
				
				Если Строка_У1.Строки.Количество() > 1 Тогда
					
					Строка_У2 = Строка_У1.Строки[1];
					
					Если Строка_У2.Строки.Количество() > 1 Тогда
						
						Строка_У3 = Строка_У2.Строки[1];
						Строка_У3.Выполняются = 1;
						
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Инд_У1 = 8 Тогда
			//молочная продукция, Некробактериоз крупного рогатого скота (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если Строка_У1.Строки.Количество() > 1 Тогда
				
				Строка_У2 = Строка_У1.Строки[1];
				Строка_У2.Выполняются = 0;
				
				Если Строка_У2.Строки.Количество() > 0 Тогда
					
					Строка_У3 = Строка_У2.Строки[0];
					Строка_У3.Выполняются = 1;
				КонецЕсли;
				
				Если Строка_У2.Строки.Количество() > 2 Тогда
					
					Строка_У3 = Строка_У2.Строки[2];
					Строка_У3.Выполняются = 1;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Инд_У1 = 9 Тогда
			//молочная продукция, Парагрипп-3 крупного рогатого скота (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
				
				Если Строка_У1.Строки.Количество() > 1 Тогда
					
					Строка_У2 = Строка_У1.Строки[1];
					Строка_У2.Выполняются = 0;
					
					Если Строка_У2.Строки.Количество() > 1 Тогда
						
						Строка_У3 = Строка_У2.Строки[1];
						Строка_У3.Выполняются = 1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Инд_У1 = 10 Тогда
			//молочная продукция, Паратуберкулез КРС (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли Инд_У1 = 11 Тогда
			//молочная продукция, Пастереллез крупного рогатого скота (пункт 1)
			
			Для каждого Строка_У2 Из Строка_У1.Строки  Цикл
				
				Строка_У2.Выполняются = 1;
				
			КонецЦикла;
			
		ИначеЕсли Инд_У1 = 12 Тогда
			//молочная продукция, Туберкулез КРС (пункт 1)
			
			Если Строка_У1.Строки.Количество() > 0 Тогда
				
				Строка_У2 = Строка_У1.Строки[0];
				Строка_У2.Выполняются = 1;
				
				Для каждого Строка_У3 Из Строка_У2.Строки  Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если Строка_У1.Строки.Количество() > 1 Тогда
				Строка_У2 = Строка_У1.Строки[1];
				Строка_У2.Выполняются = 0;
				
				Если Строка_У2.Строки.Количество() > 1 Тогда
					
					Строка_У3 = Строка_У2.Строки[1];
					Строка_У3.Выполняются = 1;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Инд_У1 = 13 Тогда
			//молочная продукция, Ящур (пункт 1)
			
			Для каждого Строка_У2 Из Строка_У1.Строки  Цикл
				
				Строка_У2.Выполняются = 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДЗ_УсловияРегионализации, "УсловияРегионализации");
	
КонецПроцедуры

&НаСервере
Процедура bt_Patch4_ЗаполнитьМОМВместоНаСервере()
	
	ДЗ_УсловияРегионализации = РеквизитФормыВЗначение("УсловияРегионализации");
	
	
	Для каждого Строка_У1 Из ДЗ_УсловияРегионализации.Строки Цикл
		
		Строка_У1.Выполняются = 1;
		
		Вариант1 = Истина;
		
		Для каждого Строка_У2 Из Строка_У1.Строки Цикл
			
			Если Вариант1 = Истина Тогда
				
				Строка_У2.Выполняются = 1;
				
			КонецЕсли;
			
			Если Строка_У2.Строки.Количество() = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если Вариант1 = Истина Тогда
				
				Для каждого Строка_У3 Из Строка_У2.Строки Цикл
					
					Строка_У3.Выполняются = 1;
					
				КонецЦикла;
				
				
			Иначе
				
				Если Строка_У2.Строки.Количество() = 1 Тогда
					
					//ничего не делаем
					
				ИначеЕсли Строка_У2.Строки.Количество() = 2 Тогда
					
					Строка_У3 = Строка_У2.Строки[1];
					Строка_У3.Выполняются = 1;
					
					
					//Строка_У2.Выполняются = 1;
					
					
				ИначеЕсли Строка_У2.Строки.Количество() = 3 Тогда
					
					Строка_У3 = Строка_У2.Строки[0];
					Строка_У3.Выполняются = 1;
					
					Строка_У3 = Строка_У2.Строки[2];
					Строка_У3.Выполняются = 1;
					
					//Строка_У2.Выполняются = 1;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Вариант1 = Ложь;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(ДЗ_УсловияРегионализации, "УсловияРегионализации");
	
КонецПроцедуры


&НаКлиенте
Процедура bt_Patch4_ЗаполнитьМОМВместо(Команда)
	bt_Patch4_ЗаполнитьМОМВместоНаСервере();
КонецПроцедуры
