
&НаКлиенте
Процедура bt_Patch2ПриОткрытииПосле(Отказ)
	
	ИзменитьДоступностьКнопокПечатиКомплектов();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьКнопокПечатиКомплектов()
	
	Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС") Тогда
		
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать.ПодчиненныеЭлементы
		.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное_4.Доступность = Ложь;   //ип
		
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать.ПодчиненныеЭлементы
		.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное_5.Доступность = Истина;
		
	Иначе 
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать.ПодчиненныеЭлементы
		.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное_4.Доступность = Истина;   //ип
		
		КоманднаяПанель.ПодчиненныеЭлементы.ПодменюПечать.ПодчиненныеЭлементы
		.ПодменюПечатьОбычное.ПодчиненныеЭлементы.ПодменюПечатьОбычное_5.Доступность = Ложь;
		
	КонецЕсли;
	

КонецПроцедуры // ИхменитьДоступностьКнопокПечатиКомплектов()

&НаКлиенте
Процедура bt_Patch2ПартнерБезКЛПриИзмененииПосле(Элемент)
	
	ИзменитьДоступностьКнопокПечатиКомплектов();
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2ОрганизацияПриИзмененииПосле(Элемент)
	
	ИзменитьДоступностьКнопокПечатиКомплектов();
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	ИзменитьДоступностьКнопокПечатиКомплектов();
	
КонецПроцедуры


&НаСервере
Процедура bt_Patch2ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Долг = 0;
	
	bt_Patch2ПартнерПриИзмененииПослеНаСервере(Объект.Партнер, Объект.Организация, Долг);
	
	Если Долг > 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Нам должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Красный;
		
	ИначеЕсли Долг < 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Мы должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Зеленый;
		
	ИНаче
		
		Элементы.Декорация5.Заголовок = "Нет задолженностей";
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Синий;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
	
		Объект.Дата = ТекущаяДата() + 86400;
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2ПартнерПриИзмененииПосле(Элемент)
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2КонтрагентПриИзмененииПосле(Элемент)
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch2Декорация5НажатиеПосле(Элемент)
	bt_Patch2РассчитатьИОборазитьДолгКлиента();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура bt_Patch2ПартнерПриИзмененииПослеНаСервере(Партнер, Организация, Долг)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ ВТКлючиАналитики
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	АналитикаУчетаПоПартнерам.Партнер = &Партнер
	|	И АналитикаУчетаПоПартнерам.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(
	|			,
	|			АналитикаУчетаПоПартнерам В
	|				(ВЫБРАТЬ
	|					ВТКлючиАналитики.КлючАналитики КАК КлючАналитики
	|				ИЗ
	|					ВТКлючиАналитики КАК ВТКлючиАналитики)) КАК РасчетыСКлиентамиОстатки";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Долг = ВыборкаДетальныеЗаписи.СуммаОстаток;
		
	КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура bt_Patch2РассчитатьИОборазитьДолгКлиента()
	
	Долг = 0;

	bt_Patch2ПартнерПриИзмененииПослеНаСервере(Объект.Партнер, Объект.Организация, Долг);
	
	Если Долг > 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Нам должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Красный;
		
	ИначеЕсли Долг < 0 Тогда
		
		Элементы.Декорация5.Заголовок = "Мы должны " + Долг;
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Зеленый;
		
	ИНаче
		
		Элементы.Декорация5.Заголовок = "Нет задолженностей";
		Элементы.Декорация5.Видимость = Истина;
		Элементы.Декорация5.ЦветТекста = WebЦвета.Синий;
		
		
	КонецЕсли;
	
	
КонецПроцедуры


