
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИспользоватьМеждународныйУчет = Ложь;
	
	Если Не ПолучитьФункциональнуюОпцию("УправлениеПредприятием") Тогда
		Элементы.ГруппаОтражениеВУчете.Видимость = Ложь;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	Возврат; //Только для использования в УП
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписаноПравилоПолученияФактаПоСтатьеБюджета" Тогда
		УправлениеФормой();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура РежимНастройкиПравилПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыНастройки = Новый Структура("ОбъектНастройки", ВыбраннаяСтрока);
	ОткрытьФорму("Обработка.НастройкаПравилПолученияФактаБюджетирования.Форма.НастройкаПравил",
									ПараметрыНастройки,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиБюджетовПриАктивизацииСтроки(Элемент)
	УстановитьДоступностьКоманд(Элементы, "СтатьиБюджетов");
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиБюджетовПриАктивизацииСтроки(Элемент)
	УстановитьДоступностьКоманд(Элементы, "ПоказателиБюджетов");
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственныеОперацииПриАктивизацииСтроки(Элемент)
	УстановитьДоступностьКоманд(Элементы, "ХозяйственныеОперации");
КонецПроцедуры


&НаКлиенте
Процедура СтатьиАктивовПассивовПриАктивизацииСтроки(Элемент)
	УстановитьДоступностьКоманд(Элементы, "СтатьиАктивовПассивов");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтразитьВУчете(Команда)
	
	
	Возврат; //Только для использования в УП
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасписаниеНажатие(Элемент)
	
	
	Возврат; //Только для использования в УП
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатРаботыПравил(Команда)
	Перем ЗаголовокОтчета;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	
	ОпределитьОбъектНастройкиПравил(ПараметрыФормы, ЗаголовокОтчета);
	
	ОткрытьФорму("Отчет.РезультатРаботыПравилПолученияФактическихДанных.Форма",
														ПараметрыФормы, , ЗаголовокОтчета);
		
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПравила(Команда)
	
	ПараметрыНастройки = Новый Структура("ОбъектНастройки", ОпределитьОбъектНастройкиПравил());
	ОткрытьФорму("Обработка.НастройкаПравилПолученияФактаБюджетирования.Форма.НастройкаПравил",
									ПараметрыНастройки,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектНастройки(Команда)
	
	ПоказатьЗначение(,ОпределитьОбъектНастройкиПравил());
	
КонецПроцедуры

&НаКлиенте
Функция МассивТабличныхЧастей()
	
	Массив = Новый Массив;
	Массив.Добавить("СтатьиБюджетов");
	Массив.Добавить("ПоказателиБюджетов");
	Массив.Добавить("ХозяйственныеОперации");
	Массив.Добавить("СтатьиАктивовПассивов");
	Массив.Добавить("ПланСчетовХозрасчетный");
	
	Возврат Массив;

КонецФункции

&НаКлиенте
Процедура Все(Команда)
	
	Массив = МассивТабличныхЧастей();
	Для Каждого ТабличнаяЧасть Из Массив Цикл
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма[ТабличнаяЧасть], 
																"ЕстьПравилаПолученияФакта", ,,, Ложь);
		Элементы["ТолькоСПравилами" + ТабличнаяЧасть].Заголовок = "Показывать";
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура БезПравил(Команда)
	
	Массив = МассивТабличныхЧастей();
	Для Каждого ТабличнаяЧасть Из Массив Цикл
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма[ТабличнаяЧасть], 
															"ЕстьПравилаПолученияФакта", 
															Ложь, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		Элементы["ТолькоСПравилами" + ТабличнаяЧасть].Заголовок = НСтр("ru = 'Только без правил'");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоСПравилами(Команда)
	
	Массив = МассивТабличныхЧастей();
	Для Каждого ТабличнаяЧасть Из Массив Цикл
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма[ТабличнаяЧасть], 
															"ЕстьПравилаПолученияФакта", 
															Истина, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		Элементы["ТолькоСПравилами" + ТабличнаяЧасть].Заголовок = НСтр("ru = 'Только с правилами'");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	Перем КоличествоДокументов;
	
	Если РежимНастройкиПравил = 0 Тогда
		Элементы.СтраницаПоСтатьямИПоказателямБюджетов.Видимость = Истина;
		Элементы.СтраницаПоИсточникамДанных.Видимость = Ложь;
	Иначе
		Элементы.СтраницаПоСтатьямИПоказателямБюджетов.Видимость = Ложь;
		Элементы.СтраницаПоИсточникамДанных.Видимость = Истина;
	КонецЕсли;
	
	Элементы.СтраницаПравилаПоСчетамМеждународногоУчета.Видимость = ИспользоватьМеждународныйУчет;
	Элементы.СтраницаПравилаПоСчетамРегламентированногоУчета.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет");
	

КонецПроцедуры


&НаКлиенте
Функция ОпределитьОбъектНастройкиПравил(ДополняемыеПараметрыФормы = Неопределено, ЗаголовокОтчета = "")
	
	Если РежимНастройкиПравил = 0 Тогда
		Если Элементы.СтраницыПравилаПоСтатьямПоказателямБюджетов.ТекущаяСтраница =
											Элементы.СтраницаПравилаПоСтатьямБюджетов Тогда
			ОбъектНастройки = Элементы.СтатьиБюджетов.ТекущаяСтрока;
			ЗаголовокОтчета = "СтатьяБюджетов = " + ОбъектНастройки;
			Если ДополняемыеПараметрыФормы <> Неопределено Тогда
				ДополняемыеПараметрыФормы.Вставить("КлючВарианта", "РезультатРаботыПравилПоСтатьеБюджетов");
				ДополняемыеПараметрыФормы.Вставить("Отбор", Новый Структура("СтатьяБюджетов", ОбъектНастройки));
			КонецЕсли;
		ИначеЕсли Элементы.СтраницыПравилаПоСтатьямПоказателямБюджетов.ТекущаяСтраница =
											Элементы.СтраницаПравилаПоПоказателямБюджетов Тогда
			ОбъектНастройки = Элементы.ПоказателиБюджетов.ТекущаяСтрока;
			ЗаголовокОтчета = "ПоказательБюджетов = " + ОбъектНастройки;
			Если ДополняемыеПараметрыФормы <> Неопределено Тогда
				ДополняемыеПараметрыФормы.Вставить("КлючВарианта", "РезультатРаботыПравилПоПоказателюБюджетов");
				ДополняемыеПараметрыФормы.Вставить("Отбор", Новый Структура("ПоказательБюджетов", ОбъектНастройки));
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Элементы.СтраницыРазделыИсточниковДанных.ТекущаяСтраница = 
											Элементы.СтраницаПравилаПоХозяйственнымОперациям Тогда
			ОбъектНастройки = Элементы.ХозяйственныеОперации.ТекущаяСтрока;
			ЗаголовокОтчета = "ХозяйственнаяОперация = " + ОбъектНастройки;
			Если ДополняемыеПараметрыФормы <> Неопределено Тогда
				ДополняемыеПараметрыФормы.Вставить("КлючВарианта", "РезультатРаботыПравилПоСтатьямБюджетов");
				ДополняемыеПараметрыФормы.Вставить("Отбор", Новый Структура("ИсточникДанных", ОбъектНастройки));
			КонецЕсли;
		ИначеЕсли Элементы.СтраницыРазделыИсточниковДанных.ТекущаяСтраница = 
											Элементы.СтраницаПравилаПоСтатьямАктивовПассивов Тогда
			ОбъектНастройки = Элементы.СтатьиАктивовПассивов.ТекущаяСтрока;
			ЗаголовокОтчета = "СтатьяАктивовПассивов = " + ОбъектНастройки;
			Если ДополняемыеПараметрыФормы <> Неопределено Тогда
				ДополняемыеПараметрыФормы.Вставить("КлючВарианта", "РезультатРаботыПравилПоПоказателямБюджетов");
				ДополняемыеПараметрыФормы.Вставить("Отбор", Новый Структура("ИсточникДанных", ОбъектНастройки));
			КонецЕсли;
		ИначеЕсли Элементы.СтраницыРазделыИсточниковДанных.ТекущаяСтраница = 
											Элементы.СтраницаПравилаПоСчетамРегламентированногоУчета Тогда
			ОбъектНастройки = Элементы.ПланСчетовХозрасчетный.ТекущаяСтрока;
			ЗаголовокОтчета = "СчетУчета = " + ОбъектНастройки;
			Если ДополняемыеПараметрыФормы <> Неопределено Тогда
				ДополняемыеПараметрыФормы.Вставить("КлючВарианта", "РезультатРаботыПравилПоСтатьямИПоказателямБюджетов");
				ДополняемыеПараметрыФормы.Вставить("Отбор", Новый Структура("ИсточникДанных", ОбъектНастройки));
			КонецЕсли;
		ИначеЕсли Элементы.СтраницыРазделыИсточниковДанных.ТекущаяСтраница = 
											Элементы.СтраницаПравилаПоСчетамМеждународногоУчета Тогда
			ОбъектНастройки = Элементы.ПланСчетовМеждународный.ТекущаяСтрока;
			ЗаголовокОтчета = "СчетУчета = " + ОбъектНастройки;
			Если ДополняемыеПараметрыФормы <> Неопределено Тогда
				ДополняемыеПараметрыФормы.Вставить("КлючВарианта", "РезультатРаботыПравилПоСтатьямИПоказателямБюджетов");
				ДополняемыеПараметрыФормы.Вставить("Отбор", Новый Структура("ИсточникДанных", ОбъектНастройки));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбъектНастройки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста 
Процедура УстановитьДоступностьКоманд(Элементы, ИмяДинамическогоСписка)
	
	ИмяЭлементаФормы = ИмяДинамическогоСписка + "НастроитьПравила";
	
	Если Элементы[ИмяДинамическогоСписка].ТекущаяСтрока = Неопределено
		Или Элементы[ИмяДинамическогоСписка].ТекущиеДанные.ЭтоГруппа Тогда
		Элементы[ИмяЭлементаФормы].Доступность = Ложь;
	Иначе
		Элементы[ИмяЭлементаФормы].Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
