

#Область ОбработчикиСобытийЭлементовТабличнойЧастиТовары

&НаКлиенте
Процедура bt_Patch4_ТоварыНадписьСрокГодностиОбработкаНавигационнойСсылкиВместо(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	bt_Patch4_ОбработатьВводПериода();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура bt_Patch4_ОбработатьВводПериода()
	
	ПоказатьВводЧисла(
	Новый ОписаниеОповещения("bt_Patch4_ОбработатьВводПериодаЗавершение",ЭтотОбъект)
	,7,"Укажите количество дней срока годности",3,0);
	
КонецПроцедуры

&НаКлиенте
Процедура bt_Patch4_ОбработатьВводПериодаЗавершение(Число, Параметры) Экспорт
	
	Если Число <> Неопределено Тогда
		
		СрокГодности = НачалоДня(ТекущаяДата()) + (Число-1)*86400;
		
		МассивСтрок = Элементы.Товары.ВыделенныеСтроки;
	
		Для каждого ТекИдентификатор Из МассивСтрок Цикл
	
			СтрокаТабличнойЧасти = Объект.Товары.НайтиПоИдентификатору(ТекИдентификатор);
	        СтрокаТабличнойЧасти.СрокГодностиНачалоПериода = СрокГодности;
			
	
		КонецЦикла; 
		
    КонецЕсли;

	

КонецПроцедуры // ОбработатьВводПериодаЗавершение()

&НаСервере
Процедура bt_Patch4_ЗаполнитьХозСубъектПослеНаСервере()

	Перем Подразделение;
	Перем Склад;
	Перем Организация;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка.Подразделение КАК Подразделение,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка.Организация КАК Организация,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Получатель КАК Склад
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
	|ГДЕ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка = &Ссылка
	|	И ПроизводствоБезЗаказаВыходныеИзделия.НомерСтроки = 1";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
		Склад = ВыборкаДетальныеЗаписи.Склад;
		Организация = ВыборкаДетальныеЗаписи.Организация;
		
	КонецЦикла;
	

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
|	ХозяйствующиеСубъектыВЕТИС.Ссылка КАК ХозяйствующийСубъектВЕТИС
|ПОМЕСТИТЬ ВТХозяйствующиеСубъектыВЕТИС
|ИЗ
|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
|ГДЕ
|	ХозяйствующиеСубъектыВЕТИС.СоответствуетОрганизации = ИСТИНА
|	И ХозяйствующиеСубъектыВЕТИС.Контрагент = &Организация
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие КАК Предприятие,
|	ХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект КАК ТорговыйОбъект,
|	ХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект КАК ПроизводственныйОбъект
|ПОМЕСТИТЬ ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ИЗ
|	Справочник.ХозяйствующиеСубъектыВЕТИС.Предприятия КАК ХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ХозяйствующиеСубъектыВЕТИСПредприятия.Ссылка В
|			(ВЫБРАТЬ
|				ВТХозяйствующиеСубъектыВЕТИС.ХозяйствующийСубъектВЕТИС
|			ИЗ
|				ВТХозяйствующиеСубъектыВЕТИС КАК ВТХозяйствующиеСубъектыВЕТИС)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие КАК Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект = &Склад
|	И ВТХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект = &Подразделение
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект = &Подразделение
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект = &Склад
|	И ВТХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект = &ПустоеПодразделение
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект = &Склад
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.Предприятие
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия КАК ВТХозяйствующиеСубъектыВЕТИСПредприятия
|ГДЕ
|	ВТХозяйствующиеСубъектыВЕТИСПредприятия.ТорговыйОбъект = НЕОПРЕДЕЛЕНО
|	И ВТХозяйствующиеСубъектыВЕТИСПредприятия.ПроизводственныйОбъект = &ПустоеПодразделение
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТХозяйствующиеСубъектыВЕТИС.ХозяйствующийСубъектВЕТИС КАК ХозяйствующийСубъектВЕТИС
|ИЗ
|	ВТХозяйствующиеСубъектыВЕТИС КАК ВТХозяйствующиеСубъектыВЕТИС";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса = МассивРезультатов[3];
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Объект.ХозяйствующийСубъект = ВыборкаДетальныеЗаписи.ХозяйствующийСубъектВЕТИС;
		
	КонецЕсли;
	
	РезультатЗапроса = МассивРезультатов[2];
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Объект.Предприятие = ВыборкаДетальныеЗаписи.Предприятие;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура bt_Patch4_ЗаполнитьХозСубъектПосле(Команда)
	bt_Patch4_ЗаполнитьХозСубъектПослеНаСервере();
КонецПроцедуры
