
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	НадоСоздаватьПриход = Ложь;
	
	Приход = ПолучитьСсылкуНаПриход(ПараметрКоманды, НадоСоздаватьПриход);
	
	Если НадоСоздаватьПриход = Истина Тогда
	
		ЗаполнитьПоступлениеНаОснованииРеализации(ПараметрКоманды, Приход);
	
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента", 
	Новый Структура("Ключ", Приход));

КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаПриход(Реализация, НадоСоздаватьПриход)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Объект
		|	И ДополнительныеСведения.Свойство.Имя = &Имя";
	
	Запрос.УстановитьПараметр("Имя", "Приобретение_830d68df4dc64d5fbcdf8bee6a482b8e");
	Запрос.УстановитьПараметр("Объект", Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		УИД = Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи.Значение);
		СсылкаНаПриход = Документы.ПриобретениеТоваровУслуг.ПолучитьСсылку(УИД);
		
		
		Если СсылкаНаПриход.ПолучитьОбъект() = Неопределено Тогда
		
			НадоСоздаватьПриход = Истина;
			
			СсылкаНаПриход = Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
			
			МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Реализация;
			МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Приобретение_830d68df4dc64d5fbcdf8bee6a482b8e");
			МенеджерЗаписи.Значение = "";
			
			Попытка
			
				МенеджерЗаписи.Записать();
			
			Исключение
				
				Сообщить(ОписаниеОшибки());
				Сообщить("Удалите вручную строку из свойства ""Приобретение""");
			
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		
		СсылкаНаПриход = Документы.ПриобретениеТоваровУслуг.ПустаяСсылка();
		НадоСоздаватьПриход = Истина;
		
	КонецЕсли;

	Возврат СсылкаНаПриход;

КонецФункции // ПолучитьСсылкуНаПриход()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьПоступлениеНаОснованииРеализации(Реализация, Приход)
	
	ПриходОбъект = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	
	
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Сделка КАК Сделка,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.Склад КАК Склад,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	РеализацияТоваровУслуг.Подразделение КАК Подразделение,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РеализацияТоваровУслуг.ПорядокОплаты КАК ПорядокОплаты,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.НоменклатураНабора КАК НоменклатураНабора,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	РеализацияТоваровУслугТовары.КодТНВЭД КАК КодТНВЭД,
	|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
	|	РеализацияТоваровУслугТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	РеализацияТоваровУслугТовары.Серия КАК Серия,
	|	РеализацияТоваровУслугТовары.Упаковка КАК Упаковка,
	|	РеализацияТоваровУслугТовары.ВидЦены КАК ВидЦены,
	|	РеализацияТоваровУслугТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	РеализацияТоваровУслугТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	РеализацияТоваровУслугТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	РеализацияТоваровУслугТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	|	РеализацияТоваровУслугТовары.СуммаСНДС КАК СуммаСНДС,
	|	РеализацияТоваровУслугТовары.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РеализацияТоваровУслугТовары.Склад КАК Склад,
	|	РеализацияТоваровУслугТовары.СрокПоставки КАК СрокПоставки,
	|	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента,
	|	РеализацияТоваровУслугТовары.КодСтроки КАК КодСтроки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Реализация";
	
	
	
	МассивРЗ = Запрос.ВыполнитьПакет();
	
	РеквизитыРеализации = МассивРЗ.Получить(0).Выбрать();
	РеквизитыРеализации.Следующий();
	
	// Заполнение шапки.
	ЗаполнитьЗначенияСвойств(ПриходОбъект, РеквизитыРеализации);
	
	
	Запрос.УстановитьПараметр("Организация", РеквизитыРеализации.Организация);
	Запрос.УстановитьПараметр("ИмяПоставщик", "ПоставщикДляСозданияПоступленийИзРеализаций_aebd5d25ec3948b5a52d8000732b0f1c");
	Запрос.УстановитьПараметр("ИмяДоговорПоставщик", "ДоговорПоставщикаДляСозданияПоступленийИзРеализаций_3bdece64bfc44d15b8e910e5c357d9d7");
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Организация
	|	И ДополнительныеСведения.Свойство.Имя = &ИмяПоставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Организация
	|	И ДополнительныеСведения.Свойство.Имя = &ИмяДоговорПоставщик";
	
	
	МассивРЗ1 = Запрос.ВыполнитьПакет();
	
	ВыборкаПоставщик = МассивРЗ1[0].Выбрать();
	ВыборкаПоставщик.Следующий();
	
	ВыборкаДоговорПоставщика = МассивРЗ1[1].Выбрать();
	ВыборкаДоговорПоставщика.Следующий();
	
	ПриходОбъект.Контрагент = ВыборкаПоставщик.Значение;
	ПриходОбъект.Партнер = ПриходОбъект.Контрагент.Партнер;
	
	ПриходОбъект.Договор = ВыборкаДоговорПоставщика.Значение;
	ПриходОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	
	ПриходОбъект.СпособДоставки = ?(
	ПриходОбъект.Договор.СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении,
	Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада,
	ПриходОбъект.Договор.СпособДоставки);
	//ПриходОбъект.ВалютаВзаиморасчетов = ПриходОбъект.Договор.ВалютаВзаиморасчетов;
	
	ПриходОбъект.Менеджер = Пользователи.ТекущийПользователь();
	ПриходОбъект.ГруппаФинансовогоУчета = ПриходОбъект.Договор.ГруппаФинансовогоУчета;
	ПриходОбъект.СтатьяДвиженияДенежныхСредств = ПриходОбъект.Договор.СтатьяДвиженияДенежныхСредств;
	ПриходОбъект.Курс = 1;
	ПриходОбъект.Кратность = 1;
	
	ПриходОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	
	
	ТоварыРеализации = МассивРЗ.Получить(1).Выбрать();
	
	Пока ТоварыРеализации.Следующий() = Истина Цикл
	
		НоваяСтрока = ПриходОбъект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТоварыРеализации);
	
	КонецЦикла;
	
	Попытка
	
		ПриходОбъект.Записать();
	
	
	Исключение
				Сообщить(ОписаниеОшибки());
	
	КонецПопытки;
	
	
	Приход = ПриходОбъект.Ссылка;
	
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Реализация;
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Приобретение_830d68df4dc64d5fbcdf8bee6a482b8e");
	МенеджерЗаписи.Значение = Приход.УникальныйИдентификатор();
	
	Попытка
	
		МенеджерЗаписи.Записать();
	
	
	Исключение
				Сообщить(ОписаниеОшибки());
	
	КонецПопытки;
	
КонецПроцедуры
