


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	НадоСоздаватьВнутреннееПотребление = Ложь;
	
	ВнутреннееПотребление = ПолучитьСсылкуНаВнутренееПотребление(ПараметрКоманды, НадоСоздаватьВнутреннееПотребление);
	
	Если НадоСоздаватьВнутреннееПотребление = Истина Тогда
		
		ЗаполнитьВнутренееПотреблениеНаОснованииПроизводственнойОперацииВЕТИС(ПараметрКоманды, ВнутреннееПотребление);
		
	КонецЕсли;
	
	ОткрытьФорму("Документ.ВнутреннееПотреблениеТоваров.Форма.ФормаДокумента", 
	Новый Структура("Ключ", ВнутреннееПотребление));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаВнутренееПотребление(ПроизводственнаяОперацияВЕТИС, НадоСоздаватьВнутреннееПотребление)
	
	ПроизводствоБезЗаказа = ПроизводственнаяОперацияВЕТИС.ДокументОснование;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект
	|	И ДополнительныеСведения.Свойство.Имя = &Имя";
	
	Запрос.УстановитьПараметр("Имя", "ВнутреннееПотреблениеСписаниеСырьяИзПроизводственнойОперацииВЕТИС_4a33a80c755f4759823cc3b7c2dabdc3");
	Запрос.УстановитьПараметр("Объект", ПроизводствоБезЗаказа);
	                                                         
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		УИД = Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи.Значение);
		СсылкаНаВнутреннееПотребление = Документы.ВнутреннееПотреблениеТоваров.ПолучитьСсылку(УИД);
		
		
		Если СсылкаНаВнутреннееПотребление.ПолучитьОбъект() = Неопределено Тогда
			
			НадоСоздаватьВнутреннееПотребление = Истина;
			
			СсылкаНаВнутреннееПотребление = Документы.ВнутреннееПотреблениеТоваров.ПустаяСсылка();
			
			МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = ПроизводствоБезЗаказа;
			МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ВнутреннееПотреблениеСписаниеСырьяИзПроизводственнойОперацииВЕТИС_4a33a80c755f4759823cc3b7c2dabdc3");
			МенеджерЗаписи.Значение = "";
			
			Попытка
				
				МенеджерЗаписи.Записать();
				
			Исключение
				
				Сообщить(ОписаниеОшибки());
				Сообщить("Удалите вручную строку из свойства ""Внутреннее потребление документа основания""");
				
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		
		СсылкаНаВнутреннееПотребление = Документы.ВнутреннееПотреблениеТоваров.ПустаяСсылка();
		НадоСоздаватьВнутреннееПотребление = Истина;
		
	КонецЕсли;
	
	Возврат СсылкаНаВнутреннееПотребление;
	
КонецФункции // ПолучитьСсылкуНаПриход()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьВнутренееПотреблениеНаОснованииПроизводственнойОперацииВЕТИС(ПроизводственнаяОперацияВЕТИС, ВнутреннееПотребление)
	
	
	ВнутреннееПотреблениеОбъект = Документы.ВнутреннееПотреблениеТоваров.СоздатьДокумент();
	
	
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("ПроизводственнаяОперацияВЕТИС", ПроизводственнаяОперацияВЕТИС);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроизводственнаяОперацияВЕТИС.Дата КАК Дата,
	|	ПроизводственнаяОперацияВЕТИС.ДокументОснование.Организация КАК Организация,
	|	ПроизводственнаяОперацияВЕТИС.ДокументОснование КАК ПроизводствоБезЗаказа,
	|	ПроизводственнаяОперацияВЕТИС.ДокументОснование.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.ПроизводственнаяОперацияВЕТИС КАК ПроизводственнаяОперацияВЕТИС
	|ГДЕ
	|	ПроизводственнаяОперацияВЕТИС.Ссылка = &ПроизводственнаяОперацияВЕТИС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроизводственнаяОперацияВЕТИССырье.Номенклатура КАК Номенклатура,
	|	ПроизводственнаяОперацияВЕТИССырье.Характеристика КАК Характеристика,
	|	ПроизводственнаяОперацияВЕТИССырье.Серия КАК Серия,
	|	ПроизводственнаяОперацияВЕТИССырье.Количество КАК Количество,
	|	ПроизводственнаяОперацияВЕТИССырье.Количество КАК КоличествоУпаковок
	|ИЗ
	|	Документ.ПроизводственнаяОперацияВЕТИС.Сырье КАК ПроизводственнаяОперацияВЕТИССырье
	|ГДЕ
	|	ПроизводственнаяОперацияВЕТИССырье.Ссылка = &ПроизводственнаяОперацияВЕТИС";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = МассивРезультатов.Получить(1).Выбрать();
	
	Статья = ПланыВидовХарактеристик.СтатьиРасходов.ПолучитьСсылку(
		Новый УникальныйИдентификатор("1e0215a9-d2c8-11e9-a72d-9d41603d49f8"));
	
	Пока ВыборкаДетальныеЗаписи.Следующий() = Истина Цикл
		
		НоваяСтрока = ВнутреннееПотреблениеОбъект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		НоваяСтрока.СтатьяРасходов = Статья;
		
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = МассивРезультатов.Получить(0).Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ВнутреннееПотреблениеОбъект.Дата = ВыборкаДетальныеЗаписи.Дата;
	ВнутреннееПотреблениеОбъект.Организация = ВыборкаДетальныеЗаписи.Организация;
	ВнутреннееПотреблениеОбъект.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
	
	
	ВнутреннееПотреблениеОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	
	ВнутреннееПотреблениеОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	Попытка
		
		ВнутреннееПотреблениеОбъект.Записать();
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроизводствоБезЗаказа) = Истина Тогда
		
		ВнутреннееПотребление = ВнутреннееПотреблениеОбъект.Ссылка;
		
		МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = ВыборкаДетальныеЗаписи.ПроизводствоБезЗаказа;
		МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ВнутреннееПотреблениеСписаниеСырьяИзПроизводственнойОперацииВЕТИС_4a33a80c755f4759823cc3b7c2dabdc3");
		МенеджерЗаписи.Значение = ВнутреннееПотребление.УникальныйИдентификатор();
		
		Попытка
			
			МенеджерЗаписи.Записать();
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЕсли;
	
	
КонецПроцедуры


