////////////////////////////////////////////////////////////////////////////////
// Процедуры, используемые для локализации документа "Разукомплектация ОС".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ФормаДокумента

Функция ТекстВопросаУдаленияОС(РезультатПроверки) Экспорт

	ТекстВопроса = Неопределено;
	
	//++ Локализация
	
	Если РезультатПроверки.ОтличаетсяНаправлениеДеятельности Тогда
		
		ТекстВопроса = НСтр("ru = 'Из табличной части будут удалены основные средства,
                             |у которых другая группа ОС, амортизационная группа или направление деятельности.
                             |Продолжить?'");
		
	Иначе
		
		ТекстВопроса = НСтр("ru = 'Из табличной части будут удалены основные средства,
                             |у которых другая группа ОС или амортизационная группа.
                             |Продолжить?'");
	КонецЕсли; 
	
	//-- Локализация

	Возврат ТекстВопроса;
	
КонецФункции
 
#КонецОбласти

#КонецОбласти
