////////////////////////////////////////////////////////////////////////////////
// ОУП: Процедуры подсистемы оперативного учета производства
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ФормированиеДвижений

// Процедура формирования движений по регистру "Трудозатраты к оформлению".
//
// Параметры:
//	ДополнительныеСвойства - Структура - дополнительные свойства документа.
//	Движения - КоллекцияДвижений -  коллекция наборов записей движений документа.
//	Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ОтразитьТрудозатратыКОформлению(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТрудозатратыКОформлению;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = Движения.ТрудозатратыКОформлению;
	Набор.Записывать = Истина;
	Набор.Загрузить(Таблица);
	
КонецПроцедуры


#КонецОбласти


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
