
#Область СлужебныеПроцедурыИФункции

Функция ПолноеИмяФизическогоЛица(ФизическоеЛицо) Экспорт
	ПолноеИмяФизическогоЛица = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ФизическоеЛицо, 
		"Фамилия,Имя,Отчество,Инициалы", 
		Истина); 
	Если ПолноеИмяФизическогоЛица.Фамилия = Неопределено Тогда
		ПолноеИмяФизическогоЛица.Фамилия = НСтр("ru = '<Объект не найден>'")
	КонецЕсли;
	Возврат ПолноеИмяФизическогоЛица;
КонецФункции

Функция ОснованияПолномочийФизическихЛиц(Организация, ФизическоеЛицо) Экспорт
	Возврат ПодписиДокументов.ОснованияПолномочийФизическихЛиц(Организация, ФизическоеЛицо);
КонецФункции

Процедура ЗаписатьОснованияПолномочийОтветственныхЛиц(Организация, ФизическоеЛицо, ОснованиеПодписи, Должность) Экспорт 
	ПодписиДокументов.ЗаписатьОснованияПолномочийОтветственныхЛиц(Организация, ФизическоеЛицо, ОснованиеПодписи, Должность)
КонецПроцедуры

Функция ИспользоватьОснованияПолномочий() Экспорт

	Возврат ПодписиДокументов.ИспользоватьОснованияПолномочий();

КонецФункции

#КонецОбласти
