

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	НадоСоздаватьВнутреннееПотребление = Ложь;
	
	ВнутреннееПотребление = ПолучитьСсылкуНаВнутренееПотребление(ПараметрКоманды, НадоСоздаватьВнутреннееПотребление);
	
	Если НадоСоздаватьВнутреннееПотребление = Истина Тогда
		
		ЗаполнитьВнутренееПотреблениеНаОснованииПроизводстваБезЗаказа(ПараметрКоманды, ВнутреннееПотребление);
		
	КонецЕсли;
	
	ОткрытьФорму("Документ.ВнутреннееПотреблениеТоваров.Форма.ФормаДокумента", 
	Новый Структура("Ключ", ВнутреннееПотребление));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаВнутренееПотребление(ПроизводствоБезЗаказа, НадоСоздаватьВнутреннееПотребление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект
	|	И ДополнительныеСведения.Свойство.Имя = &Имя";
	
	Запрос.УстановитьПараметр("Имя", "ВнутреннееПотреблениеСписание_0d0579de2afe4230a440db908ea35b93");
	Запрос.УстановитьПараметр("Объект", ПроизводствоБезЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		УИД = Новый УникальныйИдентификатор(ВыборкаДетальныеЗаписи.Значение);
		СсылкаНаВнутреннееПотребление = Документы.ВнутреннееПотреблениеТоваров.ПолучитьСсылку(УИД);
		
		
		Если СсылкаНаВнутреннееПотребление.ПолучитьОбъект() = Неопределено Тогда
			
			НадоСоздаватьВнутреннееПотребление = Истина;
			
			СсылкаНаВнутреннееПотребление = Документы.ВнутреннееПотреблениеТоваров.ПустаяСсылка();
			
			МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = ПроизводствоБезЗаказа;
			МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ВнутреннееПотреблениеСписание_0d0579de2afe4230a440db908ea35b93");
			МенеджерЗаписи.Значение = "";
			
			Попытка
				
				МенеджерЗаписи.Записать();
				
			Исключение
				
				Сообщить(ОписаниеОшибки());
				Сообщить("Удалите вручную строку из свойства ""Внутреннее потребление""");
				
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		
		СсылкаНаВнутреннееПотребление = Документы.ВнутреннееПотреблениеТоваров.ПустаяСсылка();
		НадоСоздаватьВнутреннееПотребление = Истина;
		
	КонецЕсли;
	
	Возврат СсылкаНаВнутреннееПотребление;
	
КонецФункции // ПолучитьСсылкуНаПриход()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьВнутренееПотреблениеНаОснованииПроизводстваБезЗаказа(ПроизводствоБезЗаказа, ВнутреннееПотребление)
	
	ВнутреннееПотреблениеОбъект = Документы.ВнутреннееПотреблениеТоваров.СоздатьДокумент();
	
	
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("ПроизводствоБезЗаказа", ПроизводствоБезЗаказа);
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Дата КАК Дата
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказаВыходныеИзделия
	|ГДЕ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка = &ПроизводствоБезЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Характеристика КАК Характеристика,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Серия КАК Серия,
	|	ПроизводствоБезЗаказаВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Количество КАК Количество,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Упаковка КАК Упаковка,
	|	ПроизводствоБезЗаказаВыходныеИзделия.Назначение КАК Назначение
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
	|ГДЕ
	|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка = &ПроизводствоБезЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозяйственныеОперации.Ссылка КАК ХозяйственнаяОперация
	|ИЗ
	|	Перечисление.ХозяйственныеОперации КАК ХозяйственныеОперации
	|ГДЕ
	|	ХозяйственныеОперации.Порядок = 430;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = МассивРезультатов.Получить(1).Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() = Истина Цикл
		
		НоваяСтрока = ВнутреннееПотреблениеОбъект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = МассивРезультатов.Получить(0).Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ВнутреннееПотреблениеОбъект.Дата = ВыборкаДетальныеЗаписи.Дата;
	
	
	ВыборкаДетальныеЗаписи = МассивРезультатов.Получить(2).Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	//ВнутреннееПотреблениеОбъект.ХозяйственнаяОперация = ВыборкаДетальныеЗаписи.ХозяйственнаяОперация;
	ВнутреннееПотреблениеОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	
	ВнутреннееПотреблениеОбъект.Ответственный = Пользователи.ТекущийПользователь();
	
	Попытка
		
		ВнутреннееПотреблениеОбъект.Записать();
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	
	ВнутреннееПотребление = ВнутреннееПотреблениеОбъект.Ссылка;
	
	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ПроизводствоБезЗаказа;
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ВнутреннееПотреблениеСписание_0d0579de2afe4230a440db908ea35b93");
	МенеджерЗаписи.Значение = ВнутреннееПотребление.УникальныйИдентификатор();
	
	Попытка
		
		МенеджерЗаписи.Записать();
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;
	
КонецПроцедуры
